export interface AddictionQuestion {
  id: number;
  question: string;
  options: { key: string; value: string }[];
}

export const AddictionQuestions: AddictionQuestion[] = [
  { id: 1, question: "Та эрүүл мэндийн шалтгаанаас өөр асуудлаар ямар нэг эмийн бодис хэрэглэдэг үү?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 2, question: "Та жороор олгодог эмийг хэтрүүлэн хэрэглэж байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 3, question: "Та нэг дор олон эмийг хэтрүүлэн хэрэглэж байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 4, question: "Та өөрт сөргөөр нөлөөлдөг бодис хэрэглэлгүйгээр 7 хоног байж чадах уу?", options: [{ key: "0", value: "Тийм" }, { key: "1", value: "Үгүй" }] },
  { id: 5, question: "Та хүссэн цагтаа сөрөг бодис, электрон тамхи хэрэглэхээ болих чадвартай юу?", options: [{ key: "0", value: "Тийм" }, { key: "1", value: "Үгүй" }] },
  { id: 6, question: "Та донтох бодисыг үргэлжлүүлэн, хэтрүүлэн хэрэглэх үү?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 7, question: "Та донтох бодисын хэрэглээгээ багасгах, хязгаарлах оролдлого хийж байсан уу?", options: [{ key: "0", value: "Тийм" }, { key: "1", value: "Үгүй" }] },
  { id: 8, question: 'Та донтох бодис хэрэглэсний улмаас "тасарч" байсан уу?', options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 9, question: "Та донтох бодисыг хэрэглэж байгаадаа таагүй мэдрэмж төрж байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 10, question: "Ойр дотны тань хүмүүс таныг донтох бодис хэрэглэж байгаатай холбоотой асуудал гаргаж байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 11, question: "Ойр дотны тань хүмүүс таныг ямар нэг донтох бодис хэрэглэж байна хэмээн сэжиглэж байна уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 12, question: "Таны донтох бодис хэрэглэх асуудалтай холбоотой гэр бүлийнхний чинь дунд бэрхшээл учирч байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 13, question: "Таны гэр бүлийн хэн нэгэн нь таны эрүүл мэндийн тулгамдсан асуудалд туслахыг хүсч байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 14, question: "Та эм, бодис хэрэглэдэг болсны улмаас найз нөхдөөсөө холдож хөндийрсөн үү?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 15, question: "Таныг донтох бодис хэрэглэсний улмаас ажил, сургуульгүй боллоо хэмээн гэр бүлийнхэн чинь гоочилж байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 16, question: "Та донтох бодис хэрэглэсний улмаас сургуульд сурах, ажил хийхэд бэрхшээл учирч байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 17, question: "Та донтох бодис хэрэглэсний улмаас ажил, сургуулиа хаяж байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 18, question: "Та донтох бодис хэтрүүлэн хэрэглэсний улмаас хэн нэгэнтэй зодолдож байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 19, question: "Та донтох бодис хэрэглэсний улмаас хэвийн бус төрх үйл, ямар нэг зөрчил гарган баривчлагдаж байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 20, question: "Та донтох бодис хэтрүүлэн хэрэглэсэн үедээ машин жолоодож байгаад саатуулагдаж байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 21, question: "Та донтох бодис олж авахын тулд хууль бус үйл ажиллагаанд оролцож байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 22, question: "Та хууль бус аргаар донтох бодис олж авсаны улмаас саатуулагдаж байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 23, question: "Та эм, донтох бодисыг хэтрүүлэн хэрэглэсний улмаас шартах шинж илэрч байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 24, question: "Та донтох бодис хэрэглэсний улмаас ой тогтоолт муудах, элэгний үрэвсэл зэрэг эрүүл мэндийн тулгамдсан асуудал илэрч байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 25, question: "Донтох бодисын хэрэглээтэй холбоотой тулгамдсан асуудлын үед та хэн нэгнээс тусламж хүсч байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 26, question: "Та донтох бодис хэрэглэсний улмаас эмнэлэгт хэвтэж эмчлүүлж байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 27, question: "Та донтох бодис хэрэглэсний улмаас тусгай хөтөлбөрт хамрагдаж байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
  { id: 28, question: "Та донтох бодис хэрэглэсний улмаас эмнэлгийн гадуурх тусламж буюу амбулаториор эмчлүүлж байсан уу?", options: [{ key: "1", value: "Тийм" }, { key: "0", value: "Үгүй" }] },
];

export interface AddictionScore {
  totalScore: number;
}

export const calculateAddictionScore = (answers: {
  [questionId: number]: string;
}): AddictionScore => {
  let totalScore = 0;
  Object.values(answers).forEach((answer) => {
    const score = parseInt(answer);
    if (!isNaN(score)) totalScore += score;
  });
  return { totalScore };
};
